docs/recs/change dates/Flow_With_EMD_RoundTrip(AUA-CUR)_INF_25-9-2018/2ond try/1-ARR_RetrieveAirAvailability.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/" xmlns:sita="http://schemas.datacontract.org/2004/07/Sita.Services.ARR" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Header>
		<hal:Config subscriberId="7I" xmlns:hal="http://sita.aero/hal"/>
	</soapenv:Header>
	<soapenv:Body>
		<tem:ARR_RetrieveAirAvailability>
			<tem:sessionID>5fd8a396-94c5-4fe3-897f-435a7d436bdf</tem:sessionID>
			 <tem:ARR_RetrieveAirAvailabilityRQ>
            <sita:displayOptionsField xsi:nil="true"/>
            <sita:originDestinationInformationField>
               <sita:arrivalLocationField>
                  <sita:locationCodeField>AUA</sita:locationCodeField>
               </sita:arrivalLocationField>
               <sita:connectionLocationsField xsi:nil="true"/>
               <sita:departureDateField>2019-01-17</sita:departureDateField>
               <sita:departureLocationField>
                  <sita:locationCodeField>CUR</sita:locationCodeField>
               </sita:departureLocationField>
               <sita:departureTimeField xsi:nil="true"/>
            </sita:originDestinationInformationField>
            <sita:specificFlightInfoField>
               <sita:airlineField>
                  <sita:codeField>7I</sita:codeField>
               </sita:airlineField>
            </sita:specificFlightInfoField>
         </tem:ARR_RetrieveAirAvailabilityRQ>
		</tem:ARR_RetrieveAirAvailability>
	</soapenv:Body>
</soapenv:Envelope>
